In [51]:
import pandas as pd
import numpy as np

In [52]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [53]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [54]:
df['col2'].nunique()

3

In [55]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [56]:
newdf = df[ (df['col1'] >2) & (df['col2'] == 444) ]

In [57]:
newdf

   col1  col2 col3
3     4   444  xyz

In [58]:
def times_two(number):
    return 2 * number

In [59]:
times_two(4)

8

In [60]:
df.apply(times_two, axis=0) #to all columns

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [61]:
df['new']=df['col1'].apply(times_two)
#or
df['new']=df['col1'].apply(lambda x: x * 2)

In [62]:
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [63]:
del df['new']

In [64]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [65]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [66]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
col1    4 non-null int64
col2    4 non-null int64
col3    4 non-null object
dtypes: int64(2), object(1)
memory usage: 176.0+ bytes

In [68]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [69]:
df.sort_values('col2', ascending= False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [70]:
df.reset_index()

   index  col1  col2 col3
0      0     1   444  abc
1      1     2   555  def
2      2     3   666  ghi
3      3     4   444  xyz